IBtaskR/WorkAround/XML/Documents/ВыпискаБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВыпискаБанка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоступлениеДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписаниеДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

IBtaskR/WorkAround/XML/Documents/ВыпискаБанка/Ext/ManagerModule.bsl
Procedure Печать(Spreadsheet, Ref) Export
	//{{_PRINT_WIZARD(Печать)
	Template = Documents.ВыпискаБанка.GetTemplate("Печать");
	Query = New Query;
	Query.Text =
	"SELECT
	|	ВыпискаБанка.Date,
	|	ВыпискаБанка.Number,
	|	ВыпискаБанка.Организация,
	|	ВыпискаБанка.ПоступлениеДС.(
	|		LineNumber,
	|		Контрагент,
	|		Сумма,
	|		Договор,
	|		НазначениеПлатежа
	|	),
	|	ВыпискаБанка.СписаниеДС.(
	|		LineNumber,
	|		Контрагент,
	|		Сумма,
	|		Договор,
	|		НазначениеПлатежа
	|	)
	|FROM
	|	Document.ВыпискаБанка AS ВыпискаБанка
	|WHERE
	|	ВыпискаБанка.Ref IN (&Ref)";
	Query.Parameters.Insert("Ref", Ref);
	Selection = Query.Execute().Select();

	AreaCaption = Template.GetArea("Caption");
	Header = Template.GetArea("Header");
	AreaПоступлениеДСHeader = Template.GetArea("ПоступлениеДСHeader");
	AreaПоступлениеДС = Template.GetArea("ПоступлениеДС");
	AreaСписаниеДСHeader = Template.GetArea("СписаниеДСHeader");
	AreaСписаниеДС = Template.GetArea("СписаниеДС");
	Spreadsheet.Clear();

	InsertPageBreak = False;
	While Selection.Next() Do
		If InsertPageBreak Then
			Spreadsheet.PutHorizontalPageBreak();
		EndIf;

		Spreadsheet.Put(AreaCaption);

		Header.Parameters.Fill(Selection);
		Spreadsheet.Put(Header, Selection.Level());

		Spreadsheet.Put(AreaПоступлениеДСHeader);
		SelectionПоступлениеДС = Selection.ПоступлениеДС.Select();
		While SelectionПоступлениеДС.Next() Do
			AreaПоступлениеДС.Parameters.Fill(SelectionПоступлениеДС);
			Spreadsheet.Put(AreaПоступлениеДС, SelectionПоступлениеДС.Level());
		EndDo;

		Spreadsheet.Put(AreaСписаниеДСHeader);
		SelectionСписаниеДС = Selection.СписаниеДС.Select();
		While SelectionСписаниеДС.Next() Do
			AreaСписаниеДС.Parameters.Fill(SelectionСписаниеДС);
			Spreadsheet.Put(AreaСписаниеДС, SelectionСписаниеДС.Level());
		EndDo;

		InsertPageBreak = True;
	EndDo;
	//}}
EndProcedure
